---
kind: type
id: T:Autodesk.Revit.DB.IntersectionResultArray
source: html/4742c1e8-0566-73c6-de42-04d98a503dfc.htm
---
# Autodesk.Revit.DB.IntersectionResultArray

An array that can contain any type of object.

## Syntax (C#)
```csharp
public class IntersectionResultArray : APIObject,
	IEnumerable
```